In [21]:
import sys
import os
import numpy as np
import random

# Go up one level from the current notebook directory
project_root = os.path.abspath(os.path.join(os.getcwd(), '..'))

# Add project root to sys.path if not already there
if project_root not in sys.path:
    sys.path.append(project_root)

# Confirm it's now in your search path
print("Project root added to sys.path:", project_root)

Project root added to sys.path: /Users/kavinmudaliar/Documents/Decathlon_Automation

In [8]:
import psycopg2
import pandas as pd
from connections import db_connections as dbc
from helpers import lunch_job_helpers as ljh

In [9]:
db_name = "postgres"
user = "shop_analyst.ffnhexmowaiglsmmbycm"
password = "infinity"
host = "aws-0-us-west-1.pooler.supabase.com"
port = "5432"

conn,cur = dbc.connect_to_postgres(db_name,user,password,host,port)

Successfully connected to the database.

In [17]:
lunch_job_sql = ljh.get_lunch_jobs_sql()
df_lunch_job = pd.read_sql(lunch_job_sql,conn)
df_lunch_job.head()

/Users/kavinmudaliar/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,job_id,job_code,job_name,min_staff_assigned,normal_staff_assigned,max_staff_assigned,job_description,priority
0,1053,GA,Gaga Area,0,0,1,None,5.0
1,1057,GAGA 1,Gaga 1 Pit,1,1,1,None,NaN
2,1061,GAGA 2,GAGA 2 Pit,1,1,1,None,NaN
3,1065,BR,Ball Room,1,1,2,None,NaN
4,1069,RR,Restrooms,1,1,2,None,NaN

In [18]:
days = ["monday", "tuesday", "wednesday", "thursday"]
days_sql = ljh.get_days_sql(cur, days)
df_days = pd.read_sql(days_sql,conn)
df_days.head()

/Users/kavinmudaliar/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    day_name
0     monday
1    tuesday
2  wednesday
3   thursday

In [19]:
eligible_staff_sql = ljh.get_eligible_staff_sql(cur, session_id = 1015)
df_eligible_staff = pd.read_sql(eligible_staff_sql,conn)
df_eligible_staff.head(15)

/Users/kavinmudaliar/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

             staff_name  session_id  staff_id  role_id  group_id
0         Abraham Paley        1015      1001     1005      1024
1           Adi Learner        1015      1005     1006      1012
2         Aditi Rairkar        1015      1007     1006      1044
3           Adrian Ruiz        1015      1009     1005      1040
4             Alex Yang        1015      1015     1006      1020
5      Annie Aliashvili        1015      1027     1006      1040
6        Ashley Sarkosh        1015      1031     1005      1060
7           Avi Sanchez        1015      1033     1005      1016
8          Cami Melcher        1015      1041     1005      1056
9         Carlos Acosta        1015      1043     1006      1000
10  Cassie Hickinbotham        1015      1047     1005      1040
11       Cate Grunewald        1015      1049     1006      1004
12              Celina         1015      1051     1005      1000
13        Charlie Premo        1015      1053     1005      1032
14           Dana Manor        1015      1057     1006      1044

In [20]:
df_group_patterns = ljh.assign_group_patterns(df_eligible_staff)
df_group_patterns.head()

   group_id base_pattern
0      1000            A
1      1004            B
2      1008            A
3      1012            B
4      1016            A